updated research.md to remove 'mermaid'
